Repository: Daniel-KM/Omeka-S-module-BulkImportFiles
Catalog: language/*.po
Languages: fr

source: The libraries of the module should be installed first.
fr: Les dépendances du module doivent être installées en premier.

source: See module’s installation documentation.
fr: Consulter la documentation d’installation du module.

source: Upload issue. Check file size and source.
fr: Problème de téléversement. Vérifiez la taille du fichier et la source.

source: Unable to upload the file. Check file size and source.
fr: Impossible de téléverser le fichier. Vérifiez la taille du fichier et la source.

source: Can’t check empty folder. Check file size and source.
fr: Impossible de vérifier un dossier vide. Vérifiez la taille du fichier et la source.

source: The folder is not inside the configured Bulk Import directory.
fr: Le dossier ne se trouve pas à l’intérieur du dossier configuré dans Bulk Import.

source: The folder is missing.
fr: Le dossier est manquant.

source: All files must have a regular name. Check ended.
fr: Tous les fichiers doivent avoir un nom corrects. Vérification terminée.

source: The folder is empty or files have error.
fr: Le dossier est vide ou les fichiers ont une erreur.

source: The media type "%s" is not managed or has no mapping.
fr: Le type de média "%s" n’est pas géré ou n’est pas aligné.

source: No mapping for this file.
fr: Pas d’alignement disponible pour ce fichier.

source: No metadata to import. You may see log for more info.
fr: Pas de métadonnées à importer. Vous pouvez consulter les journaux pour davantage d’informations.

source: No metadata: mapping is empty.
fr: Pas de métadonnées : l’alignement est vide.

source: Request empty.
fr: La requête est vide.

source: Could not save file "%s" for writing.
fr: Impossible d’enregistrer le fichier "%s".

source: File successfully added!
fr: Fichier ajouté avec succès !

source: Filepath string should be longer that zero character.
fr: Le chemin doit avoir une longueur supérieure à zéro caractère.

source: File "%s" is not writeable. Check rights.
fr: Le fichier "%s" n’est pas accessible en écriture. Vérifiez les droits.

source: Could not delete file "%s".
fr: Impossible de supprimer le fichier "%s".

source: File successfully deleted!
fr: Fichier supprimé avec succès !

source: Folder /modules/BulkImportFiles/data/mapping is not available or not writeable.
fr: Le dossier /modules/BulkImportFiles/data/mapping est indisponible ou n’est pas accessible en écriture.

source: Unable to create a new mapping in folder data/mapping.
fr: Impossible de créer un nouvel alignement dans le dossier data/mapping.

source: Filepath "%s" is not writeable.
fr: Le chemin "%s" n’est pas accessible en écriture.

source: Mapping of properties successfully updated.
fr: L’alignement des propriétés a été correctement enregistré.

source: Can’t update mapping.
fr: Impossible de mettre à jour les alignements.

source: Folder not exist
fr: Dossier inexistant

source: Can’t check empty folder
fr: Impossible de vérifier un dossier vide

source: This module requires the module "%s".
fr: Ce module requiert le module "%s".

source: This module requires modules "%s".
fr: Ce module requiert les modules "%s".

source: This module has resources that cannot be installed.
fr: Ce module a des ressources qui ne peuvent pas être installées.

source: The module "%s" was automatically deactivated because the dependencies are unavailable.
fr: Le module "%s" a été automatiquement désactivé car ses dépendances ne sont plus disponibles.

source: Total files
fr: Total des fichiers

source: Importable files
fr: Fichiers importables

source: Origin
fr: Origine

source: Directory on server
fr: Dossier sur le serveur

source: Uploaded files
fr: Fichiers téléversés

source: Make recognize and add
fr: Reconnaître et ajouter

source: File name
fr: Nom de fichier

source: Has mapping
fr: A un alignement

source: Error during upload.
fr: Erreur durant le téléversement.

source: Selected files
fr: Fichiers sélectionnés

source: %d available fields
fr: %d champs disponibles

source: No available fields
fr: Pas de champs disponibles

source: Show all data
fr: Afficher toutes les données

source: Field
fr: Champ

source: Value
fr: Valeur

source: Recognized fields
fr: Champs identifiés

source: No recognized fields
fr: Pas de champ identifié

source: Make bulk import files
fr: Importer des fichiers

source: Bulk import files
fr: Import de fichiers

source: Select folder
fr: Choisir un dossier

source: You can either select a folder on your computer or on the server.
fr: Vous pouvez choisir un dossier soit dans votre ordinateur, soit sur le serveur.

source: It is recommended to use the server for big import to allow to continue to use the browser and to avoid the server upload limits for total size and number of files.
fr: Il est recommandé de déposer les fichiers sur le serveur pour des imports de grande taille de façon à pouvoir continuer à utiliser le navigateur et à éviter d’atteindre les limites de téléversement en taille et en nombre de fichiers.

source: Source directory on server
fr: Dossier source sur le serveur

source: Enter the absolute path to the directory where files to be imported will be added.
fr: Indiquer le chemin absolu du dossier dans lequel les fichiers à importer seront ajoutés.

source: The directory can be anywhere on your server. Your root path is: %s
fr: Le dossier peut se trouver partout sur le serveur. Votre chemin racine est : %s

source: Check
fr: Vérification

source: Select folder on computer
fr: Choisir un dossier dans l’ordinateur

source: Parameters
fr: Paramètres

source: Import unmapped files
fr: Importer les fichiers non configurés

source: Allow to import all files of a folder. Unmapped files will be imported without metadata, except the file name as title.
fr: Permet d’importer tous les fichiers d’un dossier. Les fichiers dont le format n’est pas configuré seront importés sans leurs métadonnées, sauf le nom de fichier en tant que titre.

source: Delete original file from the folder on the server
fr: Supprimer le fichier original dans le dossier du serveur

source: Do you want to delete a file from the source directory after it has been imported? If so, the directory must be server-writeable.
fr: Voulez-vous supprimer le fichier du dossier source après import ? Dans ce cas, le dossier doit être accessible en écriture par le serveur.

source: Please wait, analysis in progress…
fr: Merci de patienter, analyse en cours…

source: Create/configure mappings
fr: Créer/configurer les alignements

source: This helper works only with the formats managed by %sGetId3%s.
fr: Cet assistant fonctionne seulement avec les formats gérés par %sGetId3%s.

source: For xml metadata like xmp, that may be more complete and precise, you need to write the xpaths yourself.
fr: Pour les métadonnées xml telles que xmp, qui peuvent être plus complètes et précises, vous devez préciser les xpaths vous-mêmes.

source: All fields should have the same format: either the object notation (%siptc.IPTCApplication.Headline%s), either the xpaths (%s/x:xmpmeta/rdf:RDF/rdf:Description/@xmp:Label%s). They should not be mixed.
fr: Tous les champs doivent avoir le même format : soit la notation objet (%siptc.IPTCApplication.Headline%s), soit des xpaths (%s/x:xmpmeta/rdf:RDF/rdf:Description/@xmp:Label%s). Ils ne doivent pas être mélangés.

source: You may need to create an item template first, with the media type as title.
fr: Vous pouvez avoir besoin de créer un modèle pour le contenu, avec le type de média en tant que titre.

source: View mappings
fr: Voir les alignements

source: No available maps for import
fr: Pas d’alignement disponible pour l’import

source: Available maps for import
fr: Alignements disponibles pour l’import

source: Map file data field (xpath or object notation)
fr: Aligner les champs depuis le fichier (xpath ou notation objet)

source: BulkImportFiles requires module BulkImport version 3.0.12 or higher.
fr: Le module Bulk Import Files requiert le module Bulk Import version 3.0.12 ou supérieur.

source: BulkImportFiles requires module BulkImport version 3.3.21 or higher.
fr: Le module Bulk Import Files requiert le module Bulk Import version 3.3.21 ou supérieur.

source: Unable to process import.
fr: Impossible d’effectuer l'import.

source: Index #{index}: Resource id for value "{value}" cannot be found: the entry is skipped.
fr: Index #{index}: impossible de trouver la ressource pour la valeur "{value}" : l’entrée est ignorée.

source: Make import
fr: Importer

source: Create mappings
fr: Création des alignements
